app/controllers/movies_controller.rb

    def index
      @all_ratings = @ratings_chosen = ['G','PG','PG-13','R']
      @ratings_chosen = !params['ratings'].nil? ? params['ratings'].keys : session['ratings']
      session['ratings'] = @ratings_chosen

      @class_title, @class_date = '', ''
      if(!params.key?(:sort)) #sort not in request so no sorting done
        @movies = Movie.with_ratings(session['ratings'])
        session['sort'] = ''
      elsif(params[:sort] == 'title') #sort by title
      session['sort'] = params[:sort]
        @movies = Movie.with_ratings(session['ratings']).order('title')

        @class_title = 'hilite'
      elsif(params[:sort] == 'date') #sort by release_date
      session['sort'] = params[:sort]
        @movies = Movie.with_ratings(session['ratings']).order('release_date')
---
SELECT "movies".* FROM "movies" WHERE (lower(rating) in ('g','pg','pg-13','r'))  ORDER BY release_date
SELECT "movies".* FROM "movies"  ORDER BY release_date